/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50525
Source Host           : localhost:3306
Source Database       : classmanager

Target Server Type    : MYSQL
Target Server Version : 50525
File Encoding         : 65001

Date: 2017-05-16 09:37:01
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `student`
-- ----------------------------
DROP TABLE IF EXISTS `student`;
CREATE TABLE `student` (
  `stuId` bigint(20) NOT NULL AUTO_INCREMENT,
  `stuNum` varchar(255) DEFAULT NULL,
  `stuName` varchar(255) DEFAULT NULL,
  `stuSex` varchar(255) DEFAULT NULL,
  `stuBirth` date DEFAULT NULL,
  `stuPwd` varchar(255) DEFAULT NULL,
  `stuPhone` varchar(255) DEFAULT NULL,
  `stuAddress` varchar(255) DEFAULT NULL,
  `clas_Id` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`stuId`),
  KEY `clas_Id` (`clas_Id`),
  CONSTRAINT `student_ibfk_1` FOREIGN KEY (`clas_Id`) REFERENCES `clas` (`clasId`)
) ENGINE=InnoDB AUTO_INCREMENT=62 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES ('1', '1', 'admin', null, null, 'admin', null, null, null);
INSERT INTO `student` VALUES ('2', '20142862', '孟祥通', '男', '1995-10-11', '20142862', '20132905', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('3', '20142867', '黄仡', '男', '1995-10-12', '20142867', '20142862', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('4', '20142871', '范亚雷', '男', '1995-10-13', '20142871', '20142867', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('5', '20142878', '王钢', '男', '1995-10-14', '20142878', '20142871', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('6', '20142894', '邵文正', '男', '1995-10-15', '20142894', '20142878', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('7', '20142903', '祖浩然', '男', '1995-10-16', '20142903', '20142894', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('8', '20142914', '王浩', '男', '1995-10-17', '20142914', '20142903', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('9', '20142917', '黄丽萍', '女', '1995-10-18', '20142917', '20142914', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('10', '20142922', '牛俊燕', '女', '1995-10-19', '20142922', '20142917', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('11', '20142925', '孙梅', '女', '1995-10-20', '20142925', '20142922', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('12', '20142930', '李营', '男', '1995-10-21', '20142930', '20142925', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('13', '20142937', '王晓思', '男', '1995-10-22', '20142937', '20142930', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('14', '20142942', '高开拓', '男', '1995-10-23', '20142942', '20142937', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('15', '20142948', '赵东睿', '男', '1995-10-24', '20142948', '20142942', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('16', '20142950', '余尉兴', '男', '1995-10-25', '20142950', '20142948', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('17', '20142959', '李锦', '女', '1995-10-26', '20142959', '20142950', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('18', '20142962', '吕泽坤', '男', '1995-10-27', '20142962', '20142959', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('19', '20142964', '张晓晨', '男', '1995-10-28', '20142964', '20142962', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('20', '20142967', '张策', '男', '1995-10-29', '20142967', '20142964', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('21', '20142975', '张秋松', '男', '1995-10-30', '20142975', '20142967', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('22', '20142983', '底云飞', '男', '1995-10-31', '20142983', '20142975', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('23', '20142992', '张雪晴', '女', '1995-11-01', '20142992', '20142983', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('24', '20142996', '严羽卿', '女', '1995-11-02', '20142996', '20142992', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('25', '20142998', '李国帅', '男', '1995-11-03', '20142998', '20142996', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('26', '20143000', '刘洋', '男', '1995-11-04', '20143000', '20142998', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('27', '20143007', '陈鹏', '男', '1995-11-05', '20143007', '20143000', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('28', '20143041', '尚晓朋', '男', '1995-11-06', '20143041', '20143007', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('29', '20143050', '王艺霖', '男', '1995-11-07', '20143050', '20143041', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('30', '20143055', '杨国力', '男', '1995-11-18', '20143055', '20143050', '信息科学与技术学院', '1');
INSERT INTO `student` VALUES ('31', '20142861', '王占京', '男', '1995-11-05', '20142861', '20142861', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('32', '20142863', '杨程鑫', '男', '1995-11-06', '20142863', '20142863', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('33', '20142868', '董浩男', '男', '1995-11-07', '20142868', '20142868', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('34', '20142872', '徐嵩盛', '男', '1995-11-18', '20142872', '20142872', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('35', '20142875', '王宏伟', '男', '1995-11-05', '20142875', '20142875', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('36', '20142880', '唐炳辉', '男', '1995-11-06', '20142880', '20142880', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('37', '20142886', '杜若憧', '女', '1995-11-07', '20142886', '20142886', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('38', '20142898', '孙哲', '男', '1995-11-18', '20142898', '20142898', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('39', '20142913', '李鹏鹏', '男', '1995-11-05', '20142913', '20142913', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('40', '20142920', '何琳琳', '女', '1995-11-06', '20142920', '20142920', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('41', '20142923', '张一博', '女', '1995-11-07', '20142923', '20142923', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('42', '20142928', '文新彦', '男', '1995-11-18', '20142928', '20142928', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('43', '20142932', '靳培港', '男', '1995-11-05', '20142932', '20142932', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('44', '20142945', '蒋陵郡', '男', '1995-11-06', '20142945', '20142945', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('45', '20142949', '张更', '男', '1995-11-07', '20142949', '20142949', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('46', '20142951', '李世洲', '男', '1995-11-18', '20142951', '20142951', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('47', '20142956', '苏月', '女', '1995-11-05', '20142956', '20142956', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('48', '20142963', '刘俊杰', '男', '1995-11-06', '20142963', '20142963', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('49', '20142966', '黄伟鹏', '男', '1995-11-07', '20142966', '20142966', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('50', '20142973', '魏垚', '男', '1995-11-18', '20142973', '20142973', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('51', '20142980', '黄梓轩', '男', '1995-11-05', '20142980', '20142980', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('52', '20142984', '程憧憬', '男', '1995-11-06', '20142984', '20142984', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('53', '20142987', '谷伟华', '女', '1995-11-07', '20142987', '20142987', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('54', '20142993', '尤凯丽', '女', '1995-11-18', '20142993', '20142993', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('55', '20142999', '王岸城', '男', '1995-11-05', '20142999', '20142999', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('56', '20143002', '何建勋', '男', '1995-11-06', '20143002', '20143002', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('57', '20143018', '李杨', '男', '1995-11-07', '20143018', '20143018', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('58', '20143048', '张作秀', '男', '1995-11-18', '20143048', '20143048', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('59', '20143051', '陈昌', '男', '1995-11-05', '20143051', '20143051', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('60', '20143059', '杨茵', '女', '1995-11-06', '20143059', '20143059', '信息科学与技术学院', '2');
INSERT INTO `student` VALUES ('61', '20143066', '毛雯雯', '女', '2017-05-02', '20143066', '20143066', '信息科学与技术学院', '2');
